rai-endata/metro-lite/HAL_Driver/Src/stm32f0xx_hal_uart_user.c
     [..] 
       (@) You can refer to the UART HAL driver header file for more useful macros 
      
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
#include "stm32f0xx_hal.h"
#include "usart1.h"
#include "usart7.h"
#include "DTE - Tx.h"
#include "seriePROG.h"
#include "Print UART.h"

/** @addtogroup STM32F0xx_HAL_Driver
  * @{
  */

/** @defgroup UART UART
  * @brief HAL UART module driver
  * @{
  */

#ifdef HAL_UART_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup UART_Private_Constants UART Private Constants
  * @{
  */
#define UART_TEACK_REACK_TIMEOUT ((uint32_t) 1000)              /*!< UART TX or RX enable acknowledge time-out value */
#define UART_TXDMA_TIMEOUTVALUE                      22000
#define UART_CR1_FIELDS  ((uint32_t)(USART_CR1_M | USART_CR1_PCE | USART_CR1_PS | \
                                     USART_CR1_TE | USART_CR1_RE | USART_CR1_OVER8)) /*!< UART or USART CR1 fields of parameters set by UART_SetConfig API */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup UART_Private_Functions   UART Private Functions
  * @{
  */
static void UART_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void UART_DMATxHalfCplt(DMA_HandleTypeDef *hdma);
static void UART_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static void UART_DMARxHalfCplt(DMA_HandleTypeDef *hdma);
static void UART_DMAError(DMA_HandleTypeDef *hdma);
static void UART_Tx_ISR (UART_HandleTypeDef *huart);
static void UART_Rx_ISR (UART_HandleTypeDef *huart,uint8_t data);
void UART_RX_TimeOut (UART_HandleTypeDef *huart);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup UART_Exported_Functions UART Exported Functions
  * @{
  */

/** @defgroup UART_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
===============================================================================
            ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to initialize the USARTx or the UARTy
    in asynchronous mode.
      (+) For the asynchronous mode the parameters below can be configured:
        (++) Baud Rate
        (++) Word Length
        (++) Stop Bit
        (++) Parity: If the parity is enabled, then the MSB bit of the data written
             in the data register is transmitted but is changed by the parity bit.
             According to device capability (support or not of 7-bit word length),
             frame length is either defined by the M bit (8-bits or 9-bits)
             or by the M1 and M0 bits (7-bit, 8-bit or 9-bit).
             Possible UART frame formats are as listed in the following table:
            
            (+++)    Table 1. UART frame format.             
            (+++)    +-----------------------------------------------------------------------+
            (+++)    |       M bit       |  PCE bit  |             UART frame                |
            (+++)    |-------------------|-----------|---------------------------------------|
            (+++)    |         0         |     0     |    | SB |    8-bit data   | STB |     |
            (+++)    |-------------------|-----------|---------------------------------------|
            (+++)    |         0         |     1     |    | SB | 7-bit data | PB | STB |     |
            (+++)    |-------------------|-----------|---------------------------------------|
            (+++)    |         1         |     0     |    | SB |    9-bit data   | STB |     |
            (+++)    |-------------------|-----------|---------------------------------------|
            (+++)    |         1         |     1     |    | SB | 8-bit data | PB | STB |     |
            (+++)    +-----------------------------------------------------------------------+
            (+++)    |  M1 bit |  M0 bit |  PCE bit  |             UART frame                |
            (+++)    |---------|---------|-----------|---------------------------------------|
            (+++)    |    0    |    0    |     0     |    | SB |    8 bit data   | STB |     |
            (+++)    |---------|---------|-----------|---------------------------------------|
            (+++)    |    0    |    0    |     1     |    | SB | 7 bit data | PB | STB |     |
            (+++)    |---------|---------|-----------|---------------------------------------|
            (+++)    |    0    |    1    |     0     |    | SB |    9 bit data   | STB |     |
            (+++)    |---------|---------|-----------|---------------------------------------|
            (+++)    |    0    |    1    |     1     |    | SB | 8 bit data | PB | STB |     |
            (+++)    |---------|---------|-----------|---------------------------------------|
            (+++)    |    1    |    0    |     0     |    | SB |    7 bit data   | STB |     |
            (+++)    |---------|---------|-----------|---------------------------------------|
            (+++)    |    1    |    0    |     1     |    | SB | 6 bit data | PB | STB |     |
            (+++)    +-----------------------------------------------------------------------+
        (++) Hardware flow control
        (++) Receiver/transmitter modes
        (++) Over Sampling Method
        (++) One-Bit Sampling Method
      (+) For the asynchronous mode, the following advanced features can be configured as well:
        (++) TX and/or RX pin level inversion
        (++) data logical level inversion
        (++) RX and TX pins swap
        (++) RX overrun detection disabling
        (++) DMA disabling on RX error
        (++) MSB first on communication line
        (++) auto Baud rate detection
    [..]
    The HAL_UART_Init(), HAL_HalfDuplex_Init() and HAL_MultiProcessor_Init()
    API follow respectively the UART asynchronous, UART Half duplex and multiprocessor mode
    configuration procedures (details for the procedures are available in reference manual).

@endverbatim
  * @{
  */

/**
  * @brief Initialize the UART mode according to the specified
  *         parameters in the UART_InitTypeDef and initialize the associated handle.
  * @param huart: UART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Init(UART_HandleTypeDef *huart)
{
  /* Check the UART handle allocation */
  if(huart == NULL)
  {
    return HAL_ERROR;
  }

