rai-endata/metro-lite/HAL_Driver/Src/stm32f0xx_hal_uart_user.c
}

static void UART_Rx_ISR (UART_HandleTypeDef *huart,uint8_t data){

	if(huart->Instance == USART1){
		UART_Rx_PRG(data);
		//PRINT_SCI_RxISR(data);
	}else if(huart->Instance == USART7){
		putBUFCIR (data, &va_rxDATA);
	}
}


void UART_RX_TimeOut (UART_HandleTypeDef *huart){
     // Ejecutada cada 1mseg
     if (huart->Rx_TO_cnt != 0){
    	 huart->Rx_TO_cnt--;
       if (huart->Rx_TO_cnt == 0){
    	   /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts for the interrupt process */
			__HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);
			__HAL_UART_DISABLE_IT(huart, UART_IT_PE);
			__HAL_UART_DISABLE_IT(huart, UART_IT_ERR);
			huart->State = HAL_UART_STATE_BUSY_RX;
			if(huart->Instance == USART1){
				UART_PROG_IniRx();
			}else if(huart->Instance == USART7){
				USART7_Ini();
			}
       }
     }
}

void UART_TX_TimeOut (UART_HandleTypeDef *huart){
     // Ejecutada cada 1mseg
     if (huart->Tx_TO_cnt != 0){
    	 huart->Tx_TO_cnt--;
       if (huart->Tx_TO_cnt == 0){

			if(huart->Instance == USART1){
				PRINT_ptrIni ();
				UART_PROG_IniTx();
				errorIRQ_UART1 = 1;
			}else if(huart->Instance == USART7){
				errorIRQ_UART7 = 1;
			}
       }
     }
}

void DisablefLAGS_UART1 (void){
    /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts for the interrupt process */
       __HAL_UART_DISABLE_IT(&huart1, UART_IT_TXE);
       __HAL_UART_DISABLE_IT(&huart1, UART_IT_RXNE);
       __HAL_UART_DISABLE_IT(&huart1, UART_IT_PE);
       __HAL_UART_DISABLE_IT(&huart1, UART_IT_ERR);
       huart1.State = HAL_UART_STATE_BUSY_RX;

       /* Process Unlocked */
       huart1.Lock = HAL_UNLOCKED;

}

void DisablefLAGS_UART7 (void){
    /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts for the interrupt process */
       __HAL_UART_DISABLE_IT(&huart7, UART_IT_TXE);
       __HAL_UART_DISABLE_IT(&huart7, UART_IT_RXNE);
       __HAL_UART_DISABLE_IT(&huart7, UART_IT_PE);
       __HAL_UART_DISABLE_IT(&huart7, UART_IT_ERR);
       huart7.State = HAL_UART_STATE_BUSY_RX;
       /* Process Unlocked */
       huart7.Lock = HAL_UNLOCKED;

}

#endif /* HAL_UART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
